<template lang="pug">
.docs-index
  p Hello World! かな
  p Kana 的基本定位是用于快速构建并迭代尝试性质的想法, 即 MVP (产品最小化可行性验证)
  p 因而专注于以最少的易于理解的逻辑提供充分的且便捷的调用/修改/扩展方法
  p 适用于前后端分离的WEB项目和APP
  p 由于为快速构建和简单应用而生, 它假设你并不会产生大规模数据(不超过你的内存大小), 因此所有数据都是直接在内存中的, 以获得最大响应速度
  p 如果你需要的是并发性能极致, 请移步 saya.satori.love, (它是由go语言实现以极限优化性能为目标的后端服务,
  p saya具有和kana一致的接口文档, 实际也可在两者之间作数据迁移)
  p ------------------------------
  p 如果一开始就将大量精力注入到繁琐的细节问题中(假想中的困难),
  p 大概率没有机会走到遭遇未能想象的困难那一步(真实的困难)
  p 人不能想象出自己所不了解的事物,
  p 在作选择时认清自己当前的真实需求, 这一点尤其重要
  p 如果你需要
  p ------------------------------
  p 特性:
  p 1. 使用内嵌数据库(nedb), 不需要任何配置, 一步安装
  p 2. 任意扩展对象, 所有对象都拥有相同的基本属性和处理的方法
  p 3. 支持无限嵌套 (这并不可怕
  p 4. 支持 websocket 频道广播(可实现事件消息实时推送与聊天室, 可实现在线多人协作)
  p 5. 支持导出数据
  p 6. 自带精确统计功能
  p 7. 自带通用管理后台
  p ------------------------------
  p 如果在阅读文档时感到困惑, 请到论坛提问(建议), 或加入群聊:
  p QQ群
  p 微信群
  p TG群
  p 不必担心是否因为自己未考虑到什么, 也许其它阅读者也遇到了同样的困惑
  p 因此,通常你的提问会被补充到文档上
</template>
